Repository: xiaocang/easydict_win32
Catalog: dotnet/src/Easydict.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, da_dk, de_de, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, ms_my, th_th, vi_vn, zh_cn, zh_tw

# TrayBrowserGetChromeExtension
source: ② Get Extension
fr_fr: ② Obtenir l'extension
ja_jp: ② 拡張機能を取得
ko_kr: ② 확장 프로그램 받기
zh_cn: ② 获取扩展
zh_tw: ② 取得擴充功能

# TrayBrowserGetFirefoxExtension
source: ② Get Extension
fr_fr: ② Obtenir l'extension
ja_jp: ② 拡張機能を取得
ko_kr: ② 확장 프로그램 받기
zh_cn: ② 获取扩展
zh_tw: ② 取得擴充功能

# TrayBrowserInstallAll
source: Install All
zh_cn: 安装全部

# TrayBrowserUninstallAll
source: Uninstall All
zh_cn: 卸载全部

# TraySettings
source: Settings
ar_sa: الإعدادات
da_dk: Indstillinger
de_de: Einstellungen
fr_fr: Paramètres
hi_in: सेटिंग्स
id_id: Pengaturan
it_it: Impostazioni
ja_jp: 設定
ko_kr: 설정
ms_my: Tetapan
th_th: การตั้งค่า
vi_vn: Cài đặt
zh_cn: 设置
zh_tw: 設定

# TrayExit
source: Exit
ar_sa: خروج
da_dk: Afslut
de_de: Beenden
fr_fr: Quitter
hi_in: बाहर निकलें
id_id: Keluar
it_it: Esci
ja_jp: 終了
ko_kr: 종료
ms_my: Keluar
th_th: ออก
vi_vn: Thoát
zh_cn: 退出
zh_tw: 結束

# ScreenCaptureExitConfirm
source: Exit screenshot?
zh_cn: 确定要退出截图吗？

# ScreenCaptureTipDetecting
source: Drag to select region | Double-click to select window | Scroll to switch | Esc to exit
fr_fr: Glisser pour sélectionner | Double-clic pour sélectionner la fenêtre | Molette pour changer | Esc pour quitter
ja_jp: ドラッグで範囲選択 | ダブルクリックでウィンドウ選択 | スクロールで切替 | Esc で終了
ko_kr: 드래그하여 영역 선택 | 더블클릭으로 창 선택 | 스크롤로 전환 | Esc로 종료
zh_cn: 拖动选择区域 | 双击选择窗口 | 滚轮切换窗口 | Esc 退出
zh_tw: 拖曳選擇區域 | 雙擊選擇視窗 | 滾輪切換視窗 | Esc 退出

# ScreenCaptureTipSelecting
source: Right-click or Esc to cancel
fr_fr: Clic droit ou Esc pour annuler
ja_jp: 右クリックまたは Esc でキャンセル
ko_kr: 우클릭 또는 Esc로 취소
zh_cn: 右键或 Esc 取消
zh_tw: 右鍵或 Esc 取消

source: Quick Translate
ar_sa: ترجمة سريعة
da_dk: Hurtigoversættelse
de_de: Schnellübersetzung
fr_fr: Traduction rapide
hi_in: त्वरित अनुवाद
id_id: Terjemahan Cepat
it_it: Traduzione rapida
ja_jp: クイック翻訳
ko_kr: 빠른 번역
ms_my: Terjemahan Pantas
th_th: แปลด่วน
vi_vn: Dịch nhanh
zh_cn: 快速翻译
zh_tw: 快速翻譯

source: Fixed Translate
ar_sa: ترجمة ثابتة
da_dk: Fast oversættelse
de_de: Feste Übersetzung
fr_fr: Traduction fixe
hi_in: स्थिर अनुवाद
id_id: Terjemahan Tetap
it_it: Traduzione fissa
ja_jp: 固定翻訳
ko_kr: 고정 번역
ms_my: Terjemahan Tetap
th_th: แปลคงที่
vi_vn: Dịch cố định
zh_cn: 固定翻译
zh_tw: 固定翻譯

# PinWindowTooltip
source: Pin window (stay on top)
ar_sa: تثبيت النافذة (البقاء في المقدمة)
da_dk: Fastgør vindue (bliv øverst)
de_de: Fenster anheften (im Vordergrund halten)
fr_fr: Épingler la fenêtre (garder au premier plan)
hi_in: विंडो पिन करें (ऊपर रखें)
id_id: Sematkan jendela (tetap di atas)
it_it: Fissa finestra (rimani in primo piano)
ja_jp: ウィンドウを固定（最前面に表示）
ko_kr: 창 고정 (항상 위에 표시)
ms_my: Pin tetingkap (kekal di atas)
th_th: ปักหมุดหน้าต่าง (แสดงด้านบนเสมอ)
vi_vn: Ghim cửa sổ (luôn trên cùng)
zh_cn: 固定窗口（保持置顶）
zh_tw: 釘選視窗（保持在最上層）

source: UI Language
ar_sa: لغة الواجهة
da_dk: Grænsefladesprog
de_de: Oberflächensprache
fr_fr: Langue de l'interface
hi_in: इंटरफ़ेस भाषा
id_id: Bahasa Antarmuka
it_it: Lingua dell'interfaccia
ja_jp: UI言語
ko_kr: UI 언어
ms_my: Bahasa Antara Muka
th_th: ภาษาของหน้าจอ
vi_vn: Ngôn ngữ giao diện
zh_cn: 界面语言
zh_tw: 介面語言

# RestartRequiredMessage
source: Please restart the application for the language change to take effect.
ar_sa: الرجاء إعادة تشغيل التطبيق لتفعيل تغيير اللغة.
da_dk: Genstart venligst applikationen for at sprogændringen træder i kraft.
de_de: Bitte starten Sie die Anwendung neu, damit die Sprachänderung wirksam wird.
fr_fr: Veuillez redémarrer l'application pour que le changement de langue prenne effet.
hi_in: भाषा परिवर्तन लागू करने के लिए कृपया एप्लिकेशन पुनः आरंभ करें।
id_id: Silakan mulai ulang aplikasi agar perubahan bahasa berlaku.
it_it: Riavvia l'applicazione per applicare la modifica della lingua.
ja_jp: 言語変更を有効にするには、アプリケーションを再起動してください。
ko_kr: 언어 변경을 적용하려면 애플리케이션을 다시 시작하세요.
ms_my: Sila mulakan semula aplikasi untuk perubahan bahasa berkuat kuasa.
th_th: กรุณารีสตาร์ทแอปพลิเคชันเพื่อให้การเปลี่ยนภาษามีผล
vi_vn: Vui lòng khởi động lại ứng dụng để thay đổi ngôn ngữ có hiệu lực.
zh_cn: 请重启应用程序以使语言更改生效。
zh_tw: 請重新啟動應用程式以使語言更改生效。

# UILangEnglish
source: English
ar_sa: الإنجليزية
da_dk: Engelsk
de_de: Englisch
fr_fr: Anglais
hi_in: अंग्रेज़ी
id_id: Inggris
it_it: Inglese
ja_jp: 英語
ko_kr: 영어
ms_my: Inggeris
th_th: อังกฤษ
vi_vn: Tiếng Anh
zh_cn: 英语
zh_tw: 英語

# UILangChineseSimplified
source: Chinese (Simplified)
ar_sa: الصينية (المبسّطة)
da_dk: Kinesisk (forenklet)
de_de: Chinesisch (Vereinfacht)
fr_fr: Chinois (simplifié)
hi_in: चीनी (सरलीकृत)
id_id: Tionghoa (Sederhana)
it_it: Cinese (Semplificato)
ja_jp: 簡体字中国語
ko_kr: 중국어(간체)
ms_my: Cina (Ringkas)
th_th: จีน (ตัวย่อ)
vi_vn: Tiếng Trung (Giản thể)
zh_cn: 简体中文
zh_tw: 簡體中文

source: Close
ar_sa: إغلاق
da_dk: Luk
de_de: Schließen
fr_fr: Fermer
hi_in: बंद करें
id_id: Tutup
it_it: Chiudi
ja_jp: 閉じる
ko_kr: 닫기
ms_my: Tutup
th_th: ปิด
vi_vn: Đóng
zh_cn: 关闭
zh_tw: 關閉

# HideWindow
source: Hide (Ctrl+Alt+F to show again)
ar_sa: إخفاء (Ctrl+Alt+F للإظهار مرة أخرى)
da_dk: Skjul (Ctrl+Alt+F for at vise igen)
de_de: Ausblenden (Ctrl+Alt+F zum erneuten Anzeigen)
fr_fr: Masquer (Ctrl+Alt+F pour réafficher)
hi_in: छुपाएँ (Ctrl+Alt+F से फिर दिखाएँ)
id_id: Sembunyikan (Ctrl+Alt+F untuk menampilkan kembali)
it_it: Nascondi (Ctrl+Alt+F per mostrare di nuovo)
ja_jp: 非表示（Ctrl+Alt+Fで再表示）
ko_kr: 숨기기 (Ctrl+Alt+F로 다시 표시)
ms_my: Sembunyikan (Ctrl+Alt+F untuk papar semula)
th_th: ซ่อน (Ctrl+Alt+F เพื่อแสดงอีกครั้ง)
vi_vn: Ẩn (Ctrl+Alt+F để hiển thị lại)
zh_cn: 隐藏 (Ctrl+Alt+F 再次显示)
zh_tw: 隱藏（Ctrl+Alt+F 再次顯示）

source: Enable International Services
ar_sa: تفعيل الخدمات الدولية
da_dk: Aktiver internationale tjenester
de_de: Internationale Dienste aktivieren
fr_fr: Activer les services internationaux
hi_in: अंतर्राष्ट्रीय सेवाएँ सक्रिय करें
id_id: Aktifkan Layanan Internasional
it_it: Abilita servizi internazionali
ja_jp: 国際サービスを有効にする
ko_kr: 국제 서비스 활성화
ms_my: Aktifkan Perkhidmatan Antarabangsa
th_th: เปิดใช้งานบริการสากล
vi_vn: Bật dịch vụ quốc tế
zh_cn: 启用国际服务
zh_tw: 啟用國際服務

# EnableInternationalServicesDescription
source: Some services (Google, DeepL, OpenAI, Gemini, etc.) require international network access and may not be available in all regions.
ar_sa: بعض الخدمات (Google وDeepL وOpenAI وGemini وغيرها) تتطلب الوصول إلى الشبكة الدولية وقد لا تكون متاحة في جميع المناطق.
da_dk: Nogle tjenester (Google, DeepL, OpenAI, Gemini osv.) kræver international netværksadgang og er muligvis ikke tilgængelige i alle regioner.
de_de: Einige Dienste (Google, DeepL, OpenAI, Gemini usw.) erfordern internationalen Netzwerkzugang und sind möglicherweise nicht in allen Regionen verfügbar.
fr_fr: Certains services (Google, DeepL, OpenAI, Gemini, etc.) nécessitent un accès réseau international et peuvent ne pas être disponibles dans toutes les régions.
hi_in: कुछ सेवाओं (Google, DeepL, OpenAI, Gemini आदि) के लिए अंतर्राष्ट्रीय नेटवर्क एक्सेस आवश्यक है और ये सभी क्षेत्रों में उपलब्ध नहीं हो सकतीं।
id_id: Beberapa layanan (Google, DeepL, OpenAI, Gemini, dll.) memerlukan akses jaringan internasional dan mungkin tidak tersedia di semua wilayah.
it_it: Alcuni servizi (Google, DeepL, OpenAI, Gemini, ecc.) richiedono accesso alla rete internazionale e potrebbero non essere disponibili in tutte le regioni.
ja_jp: 一部のサービス（Google、DeepL、OpenAI、Gemini など）は国際ネットワークアクセスが必要で、地域によっては利用できない場合があります。
ko_kr: 일부 서비스(Google, DeepL, OpenAI, Gemini 등)는 국제 네트워크 접근이 필요하며, 일부 지역에서는 사용할 수 없을 수 있습니다.
ms_my: Sesetengah perkhidmatan (Google, DeepL, OpenAI, Gemini, dll.) memerlukan akses rangkaian antarabangsa dan mungkin tidak tersedia di semua rantau.
th_th: บริการบางอย่าง (Google, DeepL, OpenAI, Gemini ฯลฯ) ต้องการการเข้าถึงเครือข่ายสากลและอาจไม่พร้อมใช้งานในทุกภูมิภาค
vi_vn: Một số dịch vụ (Google, DeepL, OpenAI, Gemini, v.v.) cần truy cập mạng quốc tế và có thể không khả dụng ở tất cả các khu vực.
zh_cn: 部分服务（Google、DeepL、OpenAI、Gemini 等）需要国际网络访问，可能在部分地区不可用。
zh_tw: 部分服務（Google、DeepL、OpenAI、Gemini 等）需要國際網路存取，可能在部分地區無法使用。

# InternationalServiceUnavailableHint
source: This service may not be available in your region. Try using Bing Translate or other region-compatible services instead. You can change enabled services in Settings.
ar_sa: قد لا تكون هذه الخدمة متاحة في منطقتك. جرب استخدام Bing Translate أو خدمات أخرى متوافقة مع المنطقة. يمكنك تغيير الخدمات المفعّلة في الإعدادات.
da_dk: Denne tjeneste er muligvis ikke tilgængelig i din region. Prøv Bing Translate eller andre regionskompatible tjenester. Du kan ændre aktiverede tjenester i Indstillinger.
de_de: Dieser Dienst ist in Ihrer Region möglicherweise nicht verfügbar. Versuchen Sie stattdessen Bing Übersetzer oder andere regionskompatible Dienste. Sie können die aktivierten Dienste in den Einstellungen ändern.
fr_fr: Ce service peut ne pas être disponible dans votre région. Essayez d'utiliser Bing Traduction ou d'autres services compatibles avec votre région. Vous pouvez modifier les services activés dans les Paramètres.
hi_in: यह सेवा आपके क्षेत्र में उपलब्ध नहीं हो सकती। Bing Translate या अन्य क्षेत्र-संगत सेवाओं का उपयोग करें। आप सेटिंग्स में सक्रिय सेवाएँ बदल सकते हैं।
id_id: Layanan ini mungkin tidak tersedia di wilayah Anda. Coba gunakan Bing Translate atau layanan lain yang kompatibel. Anda dapat mengubah layanan yang diaktifkan di Pengaturan.
it_it: Questo servizio potrebbe non essere disponibile nella tua regione. Prova a usare Bing Translate o altri servizi compatibili. Puoi modificare i servizi abilitati nelle Impostazioni.
ja_jp: このサービスはお住まいの地域では利用できない可能性があります。Bing翻訳または他の地域対応サービスをお試しください。設定で有効なサービスを変更できます。
ko_kr: 이 서비스는 귀하의 지역에서 사용할 수 없을 수 있습니다. Bing 번역 또는 다른 지역 호환 서비스를 사용해 보세요. 설정에서 활성화된 서비스를 변경할 수 있습니다.
ms_my: Perkhidmatan ini mungkin tidak tersedia di rantau anda. Cuba gunakan Bing Translate atau perkhidmatan lain yang serasi. Anda boleh menukar perkhidmatan yang diaktifkan dalam Tetapan.
th_th: บริการนี้อาจไม่พร้อมใช้งานในภูมิภาคของคุณ ลองใช้ Bing Translate หรือบริการที่เข้ากันได้กับภูมิภาคอื่น คุณสามารถเปลี่ยนบริการที่เปิดใช้งานในการตั้งค่า
vi_vn: Dịch vụ này có thể không khả dụng ở khu vực của bạn. Hãy thử sử dụng Bing Translate hoặc các dịch vụ tương thích khác. Bạn có thể thay đổi dịch vụ đã bật trong Cài đặt.
zh_cn: 此服务在您所在的地区可能不可用。请尝试使用必应翻译或其他国内可用的翻译服务。您可以在设置中更改启用的服务。
zh_tw: 此服務在您所在的地區可能無法使用。請嘗試使用 Bing 翻譯或其他地區相容的翻譯服務。您可以在設定中更改啟用的服務。

source: App Theme
ar_sa: سمة التطبيق
da_dk: App-tema
de_de: App-Design
fr_fr: Thème de l'application
hi_in: ऐप थीम
id_id: Tema Aplikasi
it_it: Tema dell'app
ja_jp: アプリのテーマ
ko_kr: 앱 테마
ms_my: Tema Aplikasi
th_th: ธีมแอป
vi_vn: Giao diện ứng dụng
zh_cn: 应用主题
zh_tw: 應用程式主題

# AppThemeDescription
source: Choose how Easydict appears. Select System to follow Windows theme.
ar_sa: اختر مظهر Easydict. اختر النظام لمتابعة سمة Windows.
da_dk: Vælg udseende for Easydict. Vælg System for at følge Windows-temaet.
de_de: Wählen Sie das Erscheinungsbild von Easydict. Wählen Sie System, um dem Windows-Design zu folgen.
fr_fr: Choisissez l'apparence d'Easydict. Sélectionnez Système pour suivre le thème Windows.
hi_in: Easydict का रूप चुनें। Windows थीम अनुसरण करने के लिए सिस्टम चुनें।
id_id: Pilih tampilan Easydict. Pilih Sistem untuk mengikuti tema Windows.
it_it: Scegli l'aspetto di Easydict. Seleziona Sistema per seguire il tema di Windows.
ja_jp: Easydictの外観を選択します。「システム」を選択するとWindowsのテーマに従います。
ko_kr: Easydict의 외관을 선택합니다. '시스템'을 선택하면 Windows 테마를 따릅니다.
ms_my: Pilih penampilan Easydict. Pilih Sistem untuk mengikut tema Windows.
th_th: เลือกรูปลักษณ์ของ Easydict เลือกระบบเพื่อใช้ธีม Windows
vi_vn: Chọn giao diện cho Easydict. Chọn Hệ thống để theo giao diện Windows.
zh_cn: 选择 Easydict 的外观。选择"系统"将跟随 Windows 主题。
zh_tw: 選擇 Easydict 的外觀。選擇「系統」將跟隨 Windows 主題。

# ThemeSystem
source: System
ar_sa: النظام
fr_fr: Système
hi_in: सिस्टम
id_id: Sistem
it_it: Sistema
ja_jp: システム
ko_kr: 시스템
ms_my: Sistem
th_th: ระบบ
vi_vn: Hệ thống
zh_cn: 系统
zh_tw: 系統

# ThemeLight
source: Light
ar_sa: فاتح
da_dk: Lyst
de_de: Hell
fr_fr: Clair
hi_in: लाइट
id_id: Terang
it_it: Chiaro
ja_jp: ライト
ko_kr: 라이트
ms_my: Cerah
th_th: สว่าง
vi_vn: Sáng
zh_cn: 浅色
zh_tw: 淺色

# ThemeDark
source: Dark
ar_sa: داكن
da_dk: Mørkt
de_de: Dunkel
fr_fr: Sombre
hi_in: डार्क
id_id: Gelap
it_it: Scuro
ja_jp: ダーク
ko_kr: 다크
ms_my: Gelap
th_th: มืด
vi_vn: Tối
zh_cn: 深色
zh_tw: 深色

# UnsavedChangesTitle
source: Unsaved Changes
ar_sa: تغييرات غير محفوظة
da_dk: Ikke-gemte ændringer
de_de: Nicht gespeicherte Änderungen
fr_fr: Modifications non enregistrées
hi_in: सहेजे नहीं गए परिवर्तन
id_id: Perubahan Belum Disimpan
it_it: Modifiche non salvate
ja_jp: 未保存の変更
ko_kr: 저장되지 않은 변경 사항
ms_my: Perubahan Belum Disimpan
th_th: การเปลี่ยนแปลงที่ยังไม่ได้บันทึก
vi_vn: Thay đổi chưa lưu
zh_cn: 未保存的更改
zh_tw: 未儲存的變更

# UnsavedChangesMessage
source: You have unsaved changes. Do you want to save them before leaving?
ar_sa: لديك تغييرات غير محفوظة. هل تريد حفظها قبل المغادرة؟
da_dk: Du har ikke-gemte ændringer. Vil du gemme dem, inden du forlader?
de_de: Sie haben nicht gespeicherte Änderungen. Möchten Sie diese vor dem Verlassen speichern?
fr_fr: Vous avez des modifications non enregistrées. Voulez-vous les enregistrer avant de quitter ?
hi_in: आपके पास सहेजे नहीं गए परिवर्तन हैं। क्या आप जाने से पहले सहेजना चाहते हैं?
id_id: Anda memiliki perubahan yang belum disimpan. Apakah Anda ingin menyimpannya sebelum pergi?
it_it: Hai delle modifiche non salvate. Vuoi salvarle prima di uscire?
ja_jp: 未保存の変更があります。離れる前に保存しますか？
ko_kr: 저장되지 않은 변경 사항이 있습니다. 나가기 전에 저장하시겠습니까?
ms_my: Anda mempunyai perubahan yang belum disimpan. Adakah anda ingin menyimpannya sebelum keluar?
th_th: คุณมีการเปลี่ยนแปลงที่ยังไม่ได้บันทึก คุณต้องการบันทึกก่อนออกหรือไม่?
vi_vn: Bạn có thay đổi chưa lưu. Bạn có muốn lưu trước khi rời đi không?
zh_cn: 您有未保存的更改。是否要在离开前保存？
zh_tw: 您有未儲存的變更。是否要在離開前儲存？

source: Don't Save
ar_sa: عدم الحفظ
da_dk: Gem ikke
de_de: Nicht speichern
fr_fr: Ne pas enregistrer
hi_in: सहेजें नहीं
id_id: Jangan Simpan
it_it: Non salvare
ja_jp: 保存しない
ko_kr: 저장 안 함
ms_my: Jangan Simpan
th_th: ไม่บันทึก
vi_vn: Không lưu
zh_cn: 不保存
zh_tw: 不儲存

source: Cancel
ar_sa: إلغاء
da_dk: Annuller
de_de: Abbrechen
fr_fr: Annuler
hi_in: रद्द करें
id_id: Batal
it_it: Annulla
ja_jp: キャンセル
ko_kr: 취소
ms_my: Batal
th_th: ยกเลิก
vi_vn: Hủy
zh_cn: 取消
zh_tw: 取消

# LanguagePickerHelpTip
source: Add/remove languages: Settings → Available Languages
ar_sa: إضافة/إزالة اللغات: الإعدادات → اللغات المتاحة
da_dk: Tilføj/fjern sprog: Indstillinger → Tilgængelige sprog
de_de: To add or remove languages, go to Settings → Language Preferences → Available Languages
fr_fr: Ajouter/supprimer des langues : Paramètres → Langues disponibles
hi_in: भाषाएँ जोड़ें/हटाएँ: सेटिंग्स → उपलब्ध भाषाएँ
id_id: Tambah/hapus bahasa: Pengaturan → Bahasa Tersedia
ja_jp: 言語の追加/削除：設定 → 利用可能な言語
ko_kr: 언어 추가/제거: 설정 → 사용 가능한 언어
ms_my: Tambah/buang bahasa: Tetapan → Bahasa Tersedia
th_th: เพิ่ม/ลบภาษา: ตั้งค่า → ภาษาที่ใช้ได้
vi_vn: Thêm/xóa ngôn ngữ: Cài đặt → Ngôn ngữ khả dụng
zh_cn: 添加/移除语言：设置 → 可用语言
zh_tw: 新增/移除語言：設定 → 可用語言

# InputHelpTip
source: Enter to translate, Shift+Enter for new line
ar_sa: Enter للترجمة، Shift+Enter لسطر جديد
da_dk: Enter for at oversætte, Shift+Enter for ny linje
fr_fr: Entrée pour traduire, Maj+Entrée pour nouvelle ligne
hi_in: Enter अनुवाद के लिए, Shift+Enter नई पंक्ति
id_id: Enter untuk menerjemahkan, Shift+Enter baris baru
ja_jp: Enter で翻訳、Shift+Enter で改行
ko_kr: Enter 번역, Shift+Enter 줄바꿈
ms_my: Enter untuk menterjemah, Shift+Enter baris baharu
th_th: Enter เพื่อแปล, Shift+Enter ขึ้นบรรทัดใหม่
vi_vn: Enter để dịch, Shift+Enter xuống dòng
zh_cn: Enter 翻译, Shift+Enter 换行
zh_tw: Enter 翻譯, Shift+Enter 換行

# HotkeysHelpTip
source: Restart required after changes
ar_sa: يتطلب إعادة التشغيل بعد التغييرات
da_dk: Genstart påkrævet efter ændringer
fr_fr: Redémarrage nécessaire après modification
hi_in: बदलाव के बाद पुनरारंभ आवश्यक
id_id: Perlu restart setelah perubahan
ja_jp: 変更後は再起動が必要
ko_kr: 변경 후 재시작 필요
ms_my: Perlu mulakan semula selepas perubahan
th_th: ต้องรีสตาร์ทหลังแก้ไข
vi_vn: Cần khởi động lại sau khi thay đổi
zh_cn: 修改后需重启生效
zh_tw: 修改後需重啟生效

# EnabledServicesHelpTip
source: Auto = auto-query, Manual = click to query
ar_sa: تلقائي = استعلام تلقائي، يدوي = انقر للاستعلام
da_dk: Auto = automatisk forespørgsel, Manuel = klik for forespørgsel
de_de: Auto: translates automatically when input is submitted. Manual: click the service header to start translation.
fr_fr: Auto = requête automatique, Manuel = cliquer pour lancer
hi_in: स्वचालित = ऑटो-क्वेरी, मैनुअल = क्लिक करके क्वेरी
id_id: Otomatis = kueri otomatis, Manual = klik untuk kueri
ja_jp: 自動 = 自動クエリ、手動 = クリックでクエリ
ko_kr: 자동 = 자동 쿼리, 수동 = 클릭하여 쿼리
ms_my: Auto = pertanyaan automatik, Manual = klik untuk pertanyaan
th_th: อัตโนมัติ = สอบถามอัตโนมัติ, ด้วยตนเอง = คลิกเพื่อสอบถาม
vi_vn: Tự động = truy vấn tự động, Thủ công = nhấn để truy vấn
zh_cn: 自动 = 自动查询，手动 = 点击查询
zh_tw: 自動 = 自動查詢，手動 = 點擊查詢

# ServiceConfigHelpTip
source: Enable services in 'Enabled Services' above first
ar_sa: فعّل الخدمات في 'الخدمات المفعّلة' أعلاه أولاً
da_dk: Aktiver tjenester under 'Aktiverede tjenester' ovenfor først
de_de: First enable services in the 'Enabled Services' section above, then configure their API keys here.
fr_fr: Activer d’abord les services dans « Services activés » ci-dessus
hi_in: पहले ऊपर 'सक्रिय सेवाएँ' में सेवाएँ सक्षम करें
id_id: Aktifkan layanan di 'Layanan Aktif' di atas terlebih dahulu
ja_jp: 先に上の「有効なサービス」で有効にしてください
ko_kr: 먼저 위의 '활성화된 서비스'에서 활성화하세요
ms_my: Aktifkan perkhidmatan dalam 'Perkhidmatan Aktif' di atas dahulu
th_th: เปิดใช้บริการใน 'บริการที่เปิดใช้' ด้านบนก่อน
vi_vn: Bật dịch vụ trong 'Dịch vụ đã bật' ở trên trước
zh_cn: 请先在上方「已启用的服务」中启用
zh_tw: 請先在上方「已啟用的服務」中啟用

source: Test
ar_sa: اختبار
de_de: Testen
fr_fr: Tester
hi_in: परीक्षण
id_id: Uji
ja_jp: テスト
ko_kr: 테스트
ms_my: Uji
th_th: ทดสอบ
vi_vn: Kiểm tra
zh_cn: 测试
zh_tw: 測試

source: Testing...
ar_sa: جارٍ الاختبار...
da_dk: Tester...
de_de: Teste...
fr_fr: Test en cours...
hi_in: परीक्षण हो रहा है...
id_id: Menguji...
it_it: Test in corso...
ja_jp: テスト中...
ko_kr: 테스트 중...
ms_my: Menguji...
th_th: กำลังทดสอบ...
vi_vn: Đang kiểm tra...
zh_cn: 测试中...
zh_tw: 測試中...

# TestSuccessTitle
source: Test Successful
ar_sa: نجح الاختبار
da_dk: Test lykkedes
de_de: Test erfolgreich
fr_fr: Test réussi
hi_in: परीक्षण सफल
id_id: Uji Berhasil
it_it: Test riuscito
ja_jp: テスト成功
ko_kr: 테스트 성공
ms_my: Ujian Berjaya
th_th: ทดสอบสำเร็จ
vi_vn: Kiểm tra thành công
zh_cn: 测试成功
zh_tw: 測試成功

# TestSuccessMessage
source: Configuration is valid. Translation completed in {0}ms.
ar_sa: التكوين صالح. اكتملت الترجمة في {0} مللي ثانية.
da_dk: Konfiguration er gyldig. Oversættelse fuldført på {0}ms.
de_de: Konfiguration ist gültig. Übersetzung in {0}ms abgeschlossen.
fr_fr: La configuration est valide. Traduction terminée en {0}ms.
hi_in: कॉन्फ़िगरेशन मान्य है। अनुवाद {0}ms में पूर्ण हुआ।
id_id: Konfigurasi valid. Terjemahan selesai dalam {0}ms.
it_it: Configurazione valida. Traduzione completata in {0}ms.
ja_jp: 設定は有効です。翻訳は {0}ms で完了しました。
ko_kr: 구성이 유효합니다. 번역이 {0}ms 만에 완료되었습니다.
ms_my: Konfigurasi sah. Terjemahan selesai dalam {0}ms.
th_th: การกำหนดค่าถูกต้อง แปลเสร็จใน {0} มิลลิวินาที
vi_vn: Cấu hình hợp lệ. Dịch hoàn thành trong {0}ms.
zh_cn: 配置有效。翻译完成，耗时 {0} 毫秒。
zh_tw: 設定有效。翻譯在 {0}ms 內完成。

# TestFailedTitle
source: Test Failed
ar_sa: فشل الاختبار
da_dk: Test mislykkedes
de_de: Test fehlgeschlagen
fr_fr: Échec du test
hi_in: परीक्षण विफल
id_id: Uji Gagal
it_it: Test fallito
ja_jp: テスト失敗
ko_kr: 테스트 실패
ms_my: Ujian Gagal
th_th: ทดสอบล้มเหลว
vi_vn: Kiểm tra thất bại
zh_cn: 测试失败
zh_tw: 測試失敗

# TestFailedMessage
source: Configuration test failed: {0}
ar_sa: فشل اختبار التكوين: {0}
da_dk: Konfigurationstest mislykkedes: {0}
de_de: Konfigurationstest fehlgeschlagen: {0}
fr_fr: Échec du test de configuration : {0}
hi_in: कॉन्फ़िगरेशन परीक्षण विफल: {0}
id_id: Uji konfigurasi gagal: {0}
it_it: Test di configurazione fallito: {0}
ja_jp: 設定テストに失敗しました：{0}
ko_kr: 구성 테스트 실패: {0}
ms_my: Ujian konfigurasi gagal: {0}
th_th: การทดสอบการกำหนดค่าล้มเหลว: {0}
vi_vn: Kiểm tra cấu hình thất bại: {0}
zh_cn: 配置测试失败：{0}
zh_tw: 設定測試失敗：{0}

# TestNotConfigured
source: Please configure the service first (API key, endpoint, etc.).
ar_sa: الرجاء تكوين الخدمة أولاً (مفتاح API، نقطة الاتصال، إلخ).
da_dk: Konfigurer venligst tjenesten først (API-nøgle, endpoint osv.).
de_de: Bitte konfigurieren Sie zuerst den Dienst (API-Schlüssel, Endpunkt usw.).
fr_fr: Veuillez d'abord configurer le service (clé API, point de terminaison, etc.).
hi_in: कृपया पहले सेवा कॉन्फ़िगर करें (API key, endpoint, आदि)।
id_id: Silakan konfigurasikan layanan terlebih dahulu (API key, endpoint, dll.).
it_it: Configura prima il servizio (chiave API, endpoint, ecc.).
ja_jp: 先にサービスを設定してください（APIキー、エンドポイントなど）。
ko_kr: 먼저 서비스를 구성해 주세요 (API 키, 엔드포인트 등).
ms_my: Sila konfigurasikan perkhidmatan terlebih dahulu (kunci API, endpoint, dll.).
th_th: กรุณากำหนดค่าบริการก่อน (API key, endpoint ฯลฯ)
vi_vn: Vui lòng cấu hình dịch vụ trước (API key, endpoint, v.v.).
zh_cn: 请先配置服务（API 密钥、端点等）。
zh_tw: 請先設定服務（API 金鑰、端點等）。

# ToggleOn
source: On
fr_fr: Activé
ja_jp: オン
ko_kr: 켜짐
zh_cn: 开
zh_tw: 開

# ToggleOff
source: Off
fr_fr: Désactivé
ja_jp: オフ
ko_kr: 꺼짐
zh_cn: 关
zh_tw: 關

source: Official API
fr_fr: API officielle
ja_jp: 公式 API
ko_kr: 공식 API
zh_cn: 官方 API
zh_tw: 官方 API

source: Web (free)
fr_fr: Web (gratuit)
ja_jp: Web（無料）
ko_kr: 웹 (무료)
zh_cn: 网页版（免费）
zh_tw: 網頁版（免費）

# QueryMode_Translation
source: Translate
fr_fr: Traduire
ja_jp: 翻訳
ko_kr: 번역
zh_cn: 翻译
zh_tw: 翻譯

# QueryMode_GrammarCorrection
source: Grammar Check
fr_fr: Vérification grammaticale
ja_jp: 文法チェック
ko_kr: 문법 검사
zh_cn: 语法纠错
zh_tw: 語法糾錯

# QueryModeButton_SwitchTooltip
source: {0} — click to switch to {1}
fr_fr: {0} — cliquer pour passer à {1}
ja_jp: {0}（クリックして{1}に切り替え）
ko_kr: {0} — 클릭하여 {1}으로 전환
zh_cn: {0}（点击切换为{1}）
zh_tw: {0}（點擊切換為{1}）

# Mode_LongDocument
source: Long Document
fr_fr: Document long
ja_jp: 長文翻訳
ko_kr: 긴 문서
zh_cn: 长文档翻译
zh_tw: 長文檔翻譯

# InputPlaceholder_Grammar
source: Enter text to check grammar...
fr_fr: Saisissez le texte à vérifier...
ja_jp: 文法をチェックするテキストを入力...
ko_kr: 문법을 검사할 텍스트를 입력하세요...
zh_cn: 输入文本以检查语法...
zh_tw: 輸入文字以檢查語法...

# ResultsTitle_Grammar
source: Grammar Check Results
fr_fr: Résultats de la vérification grammaticale
ja_jp: 文法チェック結果
ko_kr: 문법 검사 결과
zh_cn: 语法检查结果
zh_tw: 語法檢查結果

# GrammarPlaceholder
source: Grammar check results will appear here...
fr_fr: Les résultats de la vérification apparaîtront ici...
ja_jp: 文法チェック結果がここに表示されます...
ko_kr: 문법 검사 결과가 여기에 표시됩니다...
zh_cn: 语法检查结果将在此处显示...
zh_tw: 語法檢查結果將在此處顯示...

# TranslateButton_Grammar_Tooltip
source: Check Grammar
fr_fr: Vérifier la grammaire
ja_jp: 文法チェック
ko_kr: 문법 검사
zh_cn: 检查语法
zh_tw: 檢查語法

# GrammarResult_Original
source: Original:
ja_jp: 原文：
ko_kr: 원문:
zh_cn: 原文：
zh_tw: 原文：

# GrammarResult_Changes
source: Changes:
fr_fr: Modifications :
ja_jp: 変更点：
ko_kr: 수정 사항:
zh_cn: 修改说明：
zh_tw: 修改說明：

# GrammarResult_NoIssues
source: No grammar issues found.
fr_fr: Aucun problème de grammaire trouvé.
ja_jp: 文法の問題は見つかりませんでした。
ko_kr: 문법 문제가 발견되지 않았습니다.
zh_cn: 未发现语法问题。
zh_tw: 未發現語法問題。

# LayoutDetection_Title
source: Layout Detection
zh_cn: 布局检测

# LayoutDetection_Description
source: ML-based layout detection for long document translation. Improves accuracy for academic papers with figures, tables, and formulas.
zh_cn: 基于 ML 的长文档布局检测，提升学术论文中图表、表格和公式的识别准确度。

# LayoutDetection_Auto
source: Auto (Recommended)
zh_cn: 自动（推荐）

# LayoutDetection_OnnxLocal
source: Local ONNX Model
zh_cn: 本地 ONNX 模型

# LayoutDetection_VisionLLM
source: Vision LLM
zh_cn: 视觉大模型

# LayoutDetection_Heuristic
source: Heuristic Only
zh_cn: 仅启发式

# LayoutDetection_DownloadModel
source: Download Model (~75MB)
zh_cn: 下载模型（约 75MB）

# LayoutDetection_Downloaded
source: ONNX Model: Ready
zh_cn: ONNX 模型：已就绪

# LayoutDetection_NotDownloaded
source: ONNX Model: Not Downloaded
zh_cn: ONNX 模型：未下载

# LayoutDetection_DownloadFailed
source: Download Failed
zh_cn: 下载失败
